Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sfr.h
/*
 * Component description for SFR
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-01-19T09:46:50Z */
#ifndef _PIC32CXMTC_SFR_COMPONENT_H_
#define _PIC32CXMTC_SFR_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SFR                                          */
/* ************************************************************************** */

/* -------- SFR_SRAM0_SW_CFG : (SFR Offset: 0x10) (R/W 32) SRAM0 Software Config Register -------- */
#define SFR_SRAM0_SW_CFG_M128LS_Pos           _UINT32_(0)                                          /* (SFR_SRAM0_SW_CFG) 128 KB Light Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M128LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M128LS_Pos)       /* (SFR_SRAM0_SW_CFG) 128 KB Light Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M128LS(value)        (SFR_SRAM0_SW_CFG_M128LS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M128LS_Pos)) /* Assigment of value for M128LS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M128DS_Pos           _UINT32_(1)                                          /* (SFR_SRAM0_SW_CFG) 128 KB Deep Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M128DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M128DS_Pos)       /* (SFR_SRAM0_SW_CFG) 128 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M128DS(value)        (SFR_SRAM0_SW_CFG_M128DS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M128DS_Pos)) /* Assigment of value for M128DS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M128SD_Pos           _UINT32_(2)                                          /* (SFR_SRAM0_SW_CFG) 128 KB Shutdown Mode Position */
#define SFR_SRAM0_SW_CFG_M128SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M128SD_Pos)       /* (SFR_SRAM0_SW_CFG) 128 KB Shutdown Mode Mask */
#define SFR_SRAM0_SW_CFG_M128SD(value)        (SFR_SRAM0_SW_CFG_M128SD_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M128SD_Pos)) /* Assigment of value for M128SD in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M256LS_Pos           _UINT32_(4)                                          /* (SFR_SRAM0_SW_CFG) 256 KB Light Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M256LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M256LS_Pos)       /* (SFR_SRAM0_SW_CFG) 256 KB Light Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M256LS(value)        (SFR_SRAM0_SW_CFG_M256LS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M256LS_Pos)) /* Assigment of value for M256LS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M256DS_Pos           _UINT32_(5)                                          /* (SFR_SRAM0_SW_CFG) 256 KB Deep Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M256DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M256DS_Pos)       /* (SFR_SRAM0_SW_CFG) 256 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M256DS(value)        (SFR_SRAM0_SW_CFG_M256DS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M256DS_Pos)) /* Assigment of value for M256DS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M256SD_Pos           _UINT32_(6)                                          /* (SFR_SRAM0_SW_CFG) 256 KB Shutdown Mode Position */
#define SFR_SRAM0_SW_CFG_M256SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M256SD_Pos)       /* (SFR_SRAM0_SW_CFG) 256 KB Shutdown Mode Mask */
#define SFR_SRAM0_SW_CFG_M256SD(value)        (SFR_SRAM0_SW_CFG_M256SD_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M256SD_Pos)) /* Assigment of value for M256SD in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M384LS_Pos           _UINT32_(8)                                          /* (SFR_SRAM0_SW_CFG) 384 KB Light Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M384LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M384LS_Pos)       /* (SFR_SRAM0_SW_CFG) 384 KB Light Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M384LS(value)        (SFR_SRAM0_SW_CFG_M384LS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M384LS_Pos)) /* Assigment of value for M384LS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M384DS_Pos           _UINT32_(9)                                          /* (SFR_SRAM0_SW_CFG) 384 KB Deep Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M384DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M384DS_Pos)       /* (SFR_SRAM0_SW_CFG) 384 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M384DS(value)        (SFR_SRAM0_SW_CFG_M384DS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M384DS_Pos)) /* Assigment of value for M384DS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M384SD_Pos           _UINT32_(10)                                         /* (SFR_SRAM0_SW_CFG) 384 KB Shutdown Mode Position */
#define SFR_SRAM0_SW_CFG_M384SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M384SD_Pos)       /* (SFR_SRAM0_SW_CFG) 384 KB Shutdown Mode Mask */
#define SFR_SRAM0_SW_CFG_M384SD(value)        (SFR_SRAM0_SW_CFG_M384SD_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M384SD_Pos)) /* Assigment of value for M384SD in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M512LS_Pos           _UINT32_(12)                                         /* (SFR_SRAM0_SW_CFG) 512 KB Light Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M512LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M512LS_Pos)       /* (SFR_SRAM0_SW_CFG) 512 KB Light Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M512LS(value)        (SFR_SRAM0_SW_CFG_M512LS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M512LS_Pos)) /* Assigment of value for M512LS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M512DS_Pos           _UINT32_(13)                                         /* (SFR_SRAM0_SW_CFG) 512 KB Deep Sleep Mode Position */
#define SFR_SRAM0_SW_CFG_M512DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M512DS_Pos)       /* (SFR_SRAM0_SW_CFG) 512 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_SW_CFG_M512DS(value)        (SFR_SRAM0_SW_CFG_M512DS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M512DS_Pos)) /* Assigment of value for M512DS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_M512SD_Pos           _UINT32_(14)                                         /* (SFR_SRAM0_SW_CFG) 512 KB Shutdown Mode Position */
#define SFR_SRAM0_SW_CFG_M512SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_M512SD_Pos)       /* (SFR_SRAM0_SW_CFG) 512 KB Shutdown Mode Mask */
#define SFR_SRAM0_SW_CFG_M512SD(value)        (SFR_SRAM0_SW_CFG_M512SD_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_M512SD_Pos)) /* Assigment of value for M512SD in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_CLKG_DIS_Pos         _UINT32_(16)                                         /* (SFR_SRAM0_SW_CFG) Clock Gating Disable Position */
#define SFR_SRAM0_SW_CFG_CLKG_DIS_Msk         (_UINT32_(0x1) << SFR_SRAM0_SW_CFG_CLKG_DIS_Pos)     /* (SFR_SRAM0_SW_CFG) Clock Gating Disable Mask */
#define SFR_SRAM0_SW_CFG_CLKG_DIS(value)      (SFR_SRAM0_SW_CFG_CLKG_DIS_Msk & (_UINT32_(value) << SFR_SRAM0_SW_CFG_CLKG_DIS_Pos)) /* Assigment of value for CLKG_DIS in the SFR_SRAM0_SW_CFG register */
#define SFR_SRAM0_SW_CFG_Msk                  _UINT32_(0x00017777)                                 /* (SFR_SRAM0_SW_CFG) Register Mask  */


/* -------- SFR_SRAM0_HW_CFG : (SFR Offset: 0x14) ( R/ 32) SRAM0 Hardware Status Register -------- */
#define SFR_SRAM0_HW_CFG_M128LS_Pos           _UINT32_(0)                                          /* (SFR_SRAM0_HW_CFG) 128 KB Light Sleep Mode Position */
#define SFR_SRAM0_HW_CFG_M128LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M128LS_Pos)       /* (SFR_SRAM0_HW_CFG) 128 KB Light Sleep Mode Mask */
#define SFR_SRAM0_HW_CFG_M128LS(value)        (SFR_SRAM0_HW_CFG_M128LS_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M128LS_Pos)) /* Assigment of value for M128LS in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_M128DS_Pos           _UINT32_(1)                                          /* (SFR_SRAM0_HW_CFG) 128 KB Deep Sleep Mode Position */
#define SFR_SRAM0_HW_CFG_M128DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M128DS_Pos)       /* (SFR_SRAM0_HW_CFG) 128 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_HW_CFG_M128DS(value)        (SFR_SRAM0_HW_CFG_M128DS_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M128DS_Pos)) /* Assigment of value for M128DS in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_M128SD_Pos           _UINT32_(2)                                          /* (SFR_SRAM0_HW_CFG) 128 KB Shutdown Mode Position */
#define SFR_SRAM0_HW_CFG_M128SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M128SD_Pos)       /* (SFR_SRAM0_HW_CFG) 128 KB Shutdown Mode Mask */
#define SFR_SRAM0_HW_CFG_M128SD(value)        (SFR_SRAM0_HW_CFG_M128SD_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M128SD_Pos)) /* Assigment of value for M128SD in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_M256LS_Pos           _UINT32_(4)                                          /* (SFR_SRAM0_HW_CFG) 256 KB Light Sleep Mode Position */
#define SFR_SRAM0_HW_CFG_M256LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M256LS_Pos)       /* (SFR_SRAM0_HW_CFG) 256 KB Light Sleep Mode Mask */
#define SFR_SRAM0_HW_CFG_M256LS(value)        (SFR_SRAM0_HW_CFG_M256LS_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M256LS_Pos)) /* Assigment of value for M256LS in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_M256DS_Pos           _UINT32_(5)                                          /* (SFR_SRAM0_HW_CFG) 256 KB Deep Sleep Mode Position */
#define SFR_SRAM0_HW_CFG_M256DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M256DS_Pos)       /* (SFR_SRAM0_HW_CFG) 256 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_HW_CFG_M256DS(value)        (SFR_SRAM0_HW_CFG_M256DS_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M256DS_Pos)) /* Assigment of value for M256DS in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_M256SD_Pos           _UINT32_(6)                                          /* (SFR_SRAM0_HW_CFG) 256 KB Shutdown Mode Position */
#define SFR_SRAM0_HW_CFG_M256SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M256SD_Pos)       /* (SFR_SRAM0_HW_CFG) 256 KB Shutdown Mode Mask */
#define SFR_SRAM0_HW_CFG_M256SD(value)        (SFR_SRAM0_HW_CFG_M256SD_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M256SD_Pos)) /* Assigment of value for M256SD in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_M384LS_Pos           _UINT32_(8)                                          /* (SFR_SRAM0_HW_CFG) 384 KB Light Sleep Mode Position */
#define SFR_SRAM0_HW_CFG_M384LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M384LS_Pos)       /* (SFR_SRAM0_HW_CFG) 384 KB Light Sleep Mode Mask */
#define SFR_SRAM0_HW_CFG_M384LS(value)        (SFR_SRAM0_HW_CFG_M384LS_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M384LS_Pos)) /* Assigment of value for M384LS in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_M384DS_Pos           _UINT32_(9)                                          /* (SFR_SRAM0_HW_CFG) 384 KB Deep Sleep Mode Position */
#define SFR_SRAM0_HW_CFG_M384DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M384DS_Pos)       /* (SFR_SRAM0_HW_CFG) 384 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_HW_CFG_M384DS(value)        (SFR_SRAM0_HW_CFG_M384DS_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M384DS_Pos)) /* Assigment of value for M384DS in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_M384SD_Pos           _UINT32_(10)                                         /* (SFR_SRAM0_HW_CFG) 384 KB Shutdown Mode Position */
#define SFR_SRAM0_HW_CFG_M384SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M384SD_Pos)       /* (SFR_SRAM0_HW_CFG) 384 KB Shutdown Mode Mask */
#define SFR_SRAM0_HW_CFG_M384SD(value)        (SFR_SRAM0_HW_CFG_M384SD_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M384SD_Pos)) /* Assigment of value for M384SD in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_M512LS_Pos           _UINT32_(12)                                         /* (SFR_SRAM0_HW_CFG) 512 KB Light Sleep Mode Position */
#define SFR_SRAM0_HW_CFG_M512LS_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M512LS_Pos)       /* (SFR_SRAM0_HW_CFG) 512 KB Light Sleep Mode Mask */
#define SFR_SRAM0_HW_CFG_M512LS(value)        (SFR_SRAM0_HW_CFG_M512LS_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M512LS_Pos)) /* Assigment of value for M512LS in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_M512DS_Pos           _UINT32_(13)                                         /* (SFR_SRAM0_HW_CFG) 512 KB Deep Sleep Mode Position */
#define SFR_SRAM0_HW_CFG_M512DS_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M512DS_Pos)       /* (SFR_SRAM0_HW_CFG) 512 KB Deep Sleep Mode Mask */
#define SFR_SRAM0_HW_CFG_M512DS(value)        (SFR_SRAM0_HW_CFG_M512DS_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M512DS_Pos)) /* Assigment of value for M512DS in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_M512SD_Pos           _UINT32_(14)                                         /* (SFR_SRAM0_HW_CFG) 512 KB Shutdown Mode Position */
#define SFR_SRAM0_HW_CFG_M512SD_Msk           (_UINT32_(0x1) << SFR_SRAM0_HW_CFG_M512SD_Pos)       /* (SFR_SRAM0_HW_CFG) 512 KB Shutdown Mode Mask */
#define SFR_SRAM0_HW_CFG_M512SD(value)        (SFR_SRAM0_HW_CFG_M512SD_Msk & (_UINT32_(value) << SFR_SRAM0_HW_CFG_M512SD_Pos)) /* Assigment of value for M512SD in the SFR_SRAM0_HW_CFG register */
#define SFR_SRAM0_HW_CFG_Msk                  _UINT32_(0x00007777)                                 /* (SFR_SRAM0_HW_CFG) Register Mask  */


/* -------- SFR_SRAM0_CH : (SFR Offset: 0x18) (R/W 32) SRAM0 Read Margin Register Channel -------- */
#define SFR_SRAM0_CH_RM0_Pos                  _UINT32_(0)                                          /* (SFR_SRAM0_CH) Read Margin Position */
#define SFR_SRAM0_CH_RM0_Msk                  (_UINT32_(0xF) << SFR_SRAM0_CH_RM0_Pos)              /* (SFR_SRAM0_CH) Read Margin Mask */
#define SFR_SRAM0_CH_RM0(value)               (SFR_SRAM0_CH_RM0_Msk & (_UINT32_(value) << SFR_SRAM0_CH_RM0_Pos)) /* Assigment of value for RM0 in the SFR_SRAM0_CH register */
#define SFR_SRAM0_CH_RME0_Pos                 _UINT32_(4)                                          /* (SFR_SRAM0_CH) Read Margin Enable Position */
#define SFR_SRAM0_CH_RME0_Msk                 (_UINT32_(0x1) << SFR_SRAM0_CH_RME0_Pos)             /* (SFR_SRAM0_CH) Read Margin Enable Mask */
#define SFR_SRAM0_CH_RME0(value)              (SFR_SRAM0_CH_RME0_Msk & (_UINT32_(value) << SFR_SRAM0_CH_RME0_Pos)) /* Assigment of value for RME0 in the SFR_SRAM0_CH register */
#define SFR_SRAM0_CH_RM1_Pos                  _UINT32_(8)                                          /* (SFR_SRAM0_CH) Read Margin Position */
#define SFR_SRAM0_CH_RM1_Msk                  (_UINT32_(0xF) << SFR_SRAM0_CH_RM1_Pos)              /* (SFR_SRAM0_CH) Read Margin Mask */
#define SFR_SRAM0_CH_RM1(value)               (SFR_SRAM0_CH_RM1_Msk & (_UINT32_(value) << SFR_SRAM0_CH_RM1_Pos)) /* Assigment of value for RM1 in the SFR_SRAM0_CH register */
#define SFR_SRAM0_CH_RME1_Pos                 _UINT32_(12)                                         /* (SFR_SRAM0_CH) Read Margin Enable Position */
#define SFR_SRAM0_CH_RME1_Msk                 (_UINT32_(0x1) << SFR_SRAM0_CH_RME1_Pos)             /* (SFR_SRAM0_CH) Read Margin Enable Mask */
#define SFR_SRAM0_CH_RME1(value)              (SFR_SRAM0_CH_RME1_Msk & (_UINT32_(value) << SFR_SRAM0_CH_RME1_Pos)) /* Assigment of value for RME1 in the SFR_SRAM0_CH register */
#define SFR_SRAM0_CH_RM2_Pos                  _UINT32_(16)                                         /* (SFR_SRAM0_CH) Read Margin Position */
#define SFR_SRAM0_CH_RM2_Msk                  (_UINT32_(0xF) << SFR_SRAM0_CH_RM2_Pos)              /* (SFR_SRAM0_CH) Read Margin Mask */
#define SFR_SRAM0_CH_RM2(value)               (SFR_SRAM0_CH_RM2_Msk & (_UINT32_(value) << SFR_SRAM0_CH_RM2_Pos)) /* Assigment of value for RM2 in the SFR_SRAM0_CH register */
#define SFR_SRAM0_CH_RME2_Pos                 _UINT32_(20)                                         /* (SFR_SRAM0_CH) Read Margin Enable Position */
#define SFR_SRAM0_CH_RME2_Msk                 (_UINT32_(0x1) << SFR_SRAM0_CH_RME2_Pos)             /* (SFR_SRAM0_CH) Read Margin Enable Mask */
#define SFR_SRAM0_CH_RME2(value)              (SFR_SRAM0_CH_RME2_Msk & (_UINT32_(value) << SFR_SRAM0_CH_RME2_Pos)) /* Assigment of value for RME2 in the SFR_SRAM0_CH register */
#define SFR_SRAM0_CH_RM3_Pos                  _UINT32_(24)                                         /* (SFR_SRAM0_CH) Read Margin Position */
#define SFR_SRAM0_CH_RM3_Msk                  (_UINT32_(0xF) << SFR_SRAM0_CH_RM3_Pos)              /* (SFR_SRAM0_CH) Read Margin Mask */
#define SFR_SRAM0_CH_RM3(value)               (SFR_SRAM0_CH_RM3_Msk & (_UINT32_(value) << SFR_SRAM0_CH_RM3_Pos)) /* Assigment of value for RM3 in the SFR_SRAM0_CH register */
#define SFR_SRAM0_CH_RME3_Pos                 _UINT32_(28)                                         /* (SFR_SRAM0_CH) Read Margin Enable Position */
#define SFR_SRAM0_CH_RME3_Msk                 (_UINT32_(0x1) << SFR_SRAM0_CH_RME3_Pos)             /* (SFR_SRAM0_CH) Read Margin Enable Mask */
#define SFR_SRAM0_CH_RME3(value)              (SFR_SRAM0_CH_RME3_Msk & (_UINT32_(value) << SFR_SRAM0_CH_RME3_Pos)) /* Assigment of value for RME3 in the SFR_SRAM0_CH register */
#define SFR_SRAM0_CH_Msk                      _UINT32_(0x1F1F1F1F)                                 /* (SFR_SRAM0_CH) Register Mask  */


