Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sfr.h
/* -------- SFR_SRAM : (SFR Offset: 0x28) (R/W 32) SRAM Configuration Register -------- */
#define SFR_SRAM_RM0_Pos                      _UINT32_(0)                                          /* (SFR_SRAM) Read Margin Position */
#define SFR_SRAM_RM0_Msk                      (_UINT32_(0xF) << SFR_SRAM_RM0_Pos)                  /* (SFR_SRAM) Read Margin Mask */
#define SFR_SRAM_RM0(value)                   (SFR_SRAM_RM0_Msk & (_UINT32_(value) << SFR_SRAM_RM0_Pos)) /* Assigment of value for RM0 in the SFR_SRAM register */
#define SFR_SRAM_RM1_Pos                      _UINT32_(4)                                          /* (SFR_SRAM) Read Margin Position */
#define SFR_SRAM_RM1_Msk                      (_UINT32_(0xF) << SFR_SRAM_RM1_Pos)                  /* (SFR_SRAM) Read Margin Mask */
#define SFR_SRAM_RM1(value)                   (SFR_SRAM_RM1_Msk & (_UINT32_(value) << SFR_SRAM_RM1_Pos)) /* Assigment of value for RM1 in the SFR_SRAM register */
#define SFR_SRAM_RM2_Pos                      _UINT32_(8)                                          /* (SFR_SRAM) Read Margin Position */
#define SFR_SRAM_RM2_Msk                      (_UINT32_(0xF) << SFR_SRAM_RM2_Pos)                  /* (SFR_SRAM) Read Margin Mask */
#define SFR_SRAM_RM2(value)                   (SFR_SRAM_RM2_Msk & (_UINT32_(value) << SFR_SRAM_RM2_Pos)) /* Assigment of value for RM2 in the SFR_SRAM register */
#define SFR_SRAM_RM3_Pos                      _UINT32_(12)                                         /* (SFR_SRAM) Read Margin Position */
#define SFR_SRAM_RM3_Msk                      (_UINT32_(0xF) << SFR_SRAM_RM3_Pos)                  /* (SFR_SRAM) Read Margin Mask */
#define SFR_SRAM_RM3(value)                   (SFR_SRAM_RM3_Msk & (_UINT32_(value) << SFR_SRAM_RM3_Pos)) /* Assigment of value for RM3 in the SFR_SRAM register */
#define SFR_SRAM_RME0_Pos                     _UINT32_(16)                                         /* (SFR_SRAM) Read Margin Enable Position */
#define SFR_SRAM_RME0_Msk                     (_UINT32_(0x1) << SFR_SRAM_RME0_Pos)                 /* (SFR_SRAM) Read Margin Enable Mask */
#define SFR_SRAM_RME0(value)                  (SFR_SRAM_RME0_Msk & (_UINT32_(value) << SFR_SRAM_RME0_Pos)) /* Assigment of value for RME0 in the SFR_SRAM register */
#define SFR_SRAM_RME1_Pos                     _UINT32_(17)                                         /* (SFR_SRAM) Read Margin Enable Position */
#define SFR_SRAM_RME1_Msk                     (_UINT32_(0x1) << SFR_SRAM_RME1_Pos)                 /* (SFR_SRAM) Read Margin Enable Mask */
#define SFR_SRAM_RME1(value)                  (SFR_SRAM_RME1_Msk & (_UINT32_(value) << SFR_SRAM_RME1_Pos)) /* Assigment of value for RME1 in the SFR_SRAM register */
#define SFR_SRAM_RME2_Pos                     _UINT32_(18)                                         /* (SFR_SRAM) Read Margin Enable Position */
#define SFR_SRAM_RME2_Msk                     (_UINT32_(0x1) << SFR_SRAM_RME2_Pos)                 /* (SFR_SRAM) Read Margin Enable Mask */
#define SFR_SRAM_RME2(value)                  (SFR_SRAM_RME2_Msk & (_UINT32_(value) << SFR_SRAM_RME2_Pos)) /* Assigment of value for RME2 in the SFR_SRAM register */
#define SFR_SRAM_RME3_Pos                     _UINT32_(19)                                         /* (SFR_SRAM) Read Margin Enable Position */
#define SFR_SRAM_RME3_Msk                     (_UINT32_(0x1) << SFR_SRAM_RME3_Pos)                 /* (SFR_SRAM) Read Margin Enable Mask */
#define SFR_SRAM_RME3(value)                  (SFR_SRAM_RME3_Msk & (_UINT32_(value) << SFR_SRAM_RME3_Pos)) /* Assigment of value for RME3 in the SFR_SRAM register */
#define SFR_SRAM_LS_Pos                       _UINT32_(24)                                         /* (SFR_SRAM) Light Sleep Mode Position */
#define SFR_SRAM_LS_Msk                       (_UINT32_(0x1) << SFR_SRAM_LS_Pos)                   /* (SFR_SRAM) Light Sleep Mode Mask */
#define SFR_SRAM_LS(value)                    (SFR_SRAM_LS_Msk & (_UINT32_(value) << SFR_SRAM_LS_Pos)) /* Assigment of value for LS in the SFR_SRAM register */
#define SFR_SRAM_DS_Pos                       _UINT32_(25)                                         /* (SFR_SRAM) Deep Sleep Mode Position */
#define SFR_SRAM_DS_Msk                       (_UINT32_(0x1) << SFR_SRAM_DS_Pos)                   /* (SFR_SRAM) Deep Sleep Mode Mask */
#define SFR_SRAM_DS(value)                    (SFR_SRAM_DS_Msk & (_UINT32_(value) << SFR_SRAM_DS_Pos)) /* Assigment of value for DS in the SFR_SRAM register */
#define SFR_SRAM_SD_Pos                       _UINT32_(26)                                         /* (SFR_SRAM) Shutdown Mode Position */
#define SFR_SRAM_SD_Msk                       (_UINT32_(0x1) << SFR_SRAM_SD_Pos)                   /* (SFR_SRAM) Shutdown Mode Mask */
#define SFR_SRAM_SD(value)                    (SFR_SRAM_SD_Msk & (_UINT32_(value) << SFR_SRAM_SD_Pos)) /* Assigment of value for SD in the SFR_SRAM register */
#define SFR_SRAM_Msk                          _UINT32_(0x070FFFFF)                                 /* (SFR_SRAM) Register Mask  */

#define SFR_SRAM_RME_Pos                      _UINT32_(16)                                         /* (SFR_SRAM Position) Read Margin Enable */
#define SFR_SRAM_RME_Msk                      (_UINT32_(0xF) << SFR_SRAM_RME_Pos)                  /* (SFR_SRAM Mask) RME */
#define SFR_SRAM_RME(value)                   (SFR_SRAM_RME_Msk & (_UINT32_(value) << SFR_SRAM_RME_Pos)) 

/* -------- SFR_CPKCC : (SFR Offset: 0x30) (R/W 32) CPKCC Memory Configuration Register -------- */
#define SFR_CPKCC_ROM_RM_Pos                  _UINT32_(0)                                          /* (SFR_CPKCC) ROM Read Margin Position */
#define SFR_CPKCC_ROM_RM_Msk                  (_UINT32_(0xF) << SFR_CPKCC_ROM_RM_Pos)              /* (SFR_CPKCC) ROM Read Margin Mask */
#define SFR_CPKCC_ROM_RM(value)               (SFR_CPKCC_ROM_RM_Msk & (_UINT32_(value) << SFR_CPKCC_ROM_RM_Pos)) /* Assigment of value for ROM_RM in the SFR_CPKCC register */
#define SFR_CPKCC_ROM_RME_Pos                 _UINT32_(4)                                          /* (SFR_CPKCC) ROM Read Margin Enable Position */
#define SFR_CPKCC_ROM_RME_Msk                 (_UINT32_(0x1) << SFR_CPKCC_ROM_RME_Pos)             /* (SFR_CPKCC) ROM Read Margin Enable Mask */
#define SFR_CPKCC_ROM_RME(value)              (SFR_CPKCC_ROM_RME_Msk & (_UINT32_(value) << SFR_CPKCC_ROM_RME_Pos)) /* Assigment of value for ROM_RME in the SFR_CPKCC register */
#define SFR_CPKCC_ROM_LS_Pos                  _UINT32_(8)                                          /* (SFR_CPKCC) ROM Light Sleep Mode Position */
#define SFR_CPKCC_ROM_LS_Msk                  (_UINT32_(0x1) << SFR_CPKCC_ROM_LS_Pos)              /* (SFR_CPKCC) ROM Light Sleep Mode Mask */
#define SFR_CPKCC_ROM_LS(value)               (SFR_CPKCC_ROM_LS_Msk & (_UINT32_(value) << SFR_CPKCC_ROM_LS_Pos)) /* Assigment of value for ROM_LS in the SFR_CPKCC register */
#define SFR_CPKCC_ROM_SD_Pos                  _UINT32_(9)                                          /* (SFR_CPKCC) Shutdown Mode Position */
#define SFR_CPKCC_ROM_SD_Msk                  (_UINT32_(0x1) << SFR_CPKCC_ROM_SD_Pos)              /* (SFR_CPKCC) Shutdown Mode Mask */
#define SFR_CPKCC_ROM_SD(value)               (SFR_CPKCC_ROM_SD_Msk & (_UINT32_(value) << SFR_CPKCC_ROM_SD_Pos)) /* Assigment of value for ROM_SD in the SFR_CPKCC register */
#define SFR_CPKCC_RAM_RM_Pos                  _UINT32_(16)                                         /* (SFR_CPKCC) RAM Read Margin Position */
#define SFR_CPKCC_RAM_RM_Msk                  (_UINT32_(0xF) << SFR_CPKCC_RAM_RM_Pos)              /* (SFR_CPKCC) RAM Read Margin Mask */
#define SFR_CPKCC_RAM_RM(value)               (SFR_CPKCC_RAM_RM_Msk & (_UINT32_(value) << SFR_CPKCC_RAM_RM_Pos)) /* Assigment of value for RAM_RM in the SFR_CPKCC register */
#define SFR_CPKCC_RAM_RME_Pos                 _UINT32_(20)                                         /* (SFR_CPKCC) RAM Read Margin Enable Position */
#define SFR_CPKCC_RAM_RME_Msk                 (_UINT32_(0x1) << SFR_CPKCC_RAM_RME_Pos)             /* (SFR_CPKCC) RAM Read Margin Enable Mask */
#define SFR_CPKCC_RAM_RME(value)              (SFR_CPKCC_RAM_RME_Msk & (_UINT32_(value) << SFR_CPKCC_RAM_RME_Pos)) /* Assigment of value for RAM_RME in the SFR_CPKCC register */
#define SFR_CPKCC_RAM_LS_Pos                  _UINT32_(24)                                         /* (SFR_CPKCC) RAM Light Sleep Mode Position */
#define SFR_CPKCC_RAM_LS_Msk                  (_UINT32_(0x1) << SFR_CPKCC_RAM_LS_Pos)              /* (SFR_CPKCC) RAM Light Sleep Mode Mask */
#define SFR_CPKCC_RAM_LS(value)               (SFR_CPKCC_RAM_LS_Msk & (_UINT32_(value) << SFR_CPKCC_RAM_LS_Pos)) /* Assigment of value for RAM_LS in the SFR_CPKCC register */
#define SFR_CPKCC_RAM_DS_Pos                  _UINT32_(25)                                         /* (SFR_CPKCC) RAM Deep Sleep Mode Position */
#define SFR_CPKCC_RAM_DS_Msk                  (_UINT32_(0x1) << SFR_CPKCC_RAM_DS_Pos)              /* (SFR_CPKCC) RAM Deep Sleep Mode Mask */
#define SFR_CPKCC_RAM_DS(value)               (SFR_CPKCC_RAM_DS_Msk & (_UINT32_(value) << SFR_CPKCC_RAM_DS_Pos)) /* Assigment of value for RAM_DS in the SFR_CPKCC register */
#define SFR_CPKCC_RAM_SD_Pos                  _UINT32_(26)                                         /* (SFR_CPKCC) Shutdown Mode Position */
#define SFR_CPKCC_RAM_SD_Msk                  (_UINT32_(0x1) << SFR_CPKCC_RAM_SD_Pos)              /* (SFR_CPKCC) Shutdown Mode Mask */
#define SFR_CPKCC_RAM_SD(value)               (SFR_CPKCC_RAM_SD_Msk & (_UINT32_(value) << SFR_CPKCC_RAM_SD_Pos)) /* Assigment of value for RAM_SD in the SFR_CPKCC register */
#define SFR_CPKCC_Msk                         _UINT32_(0x071F031F)                                 /* (SFR_CPKCC) Register Mask  */


/* -------- SFR_HROMC : (SFR Offset: 0x40) (R/W 32) HROMC Memory Configuration Register -------- */
#define SFR_HROMC_RM_Pos                      _UINT32_(0)                                          /* (SFR_HROMC) Read Margin Position */
#define SFR_HROMC_RM_Msk                      (_UINT32_(0xF) << SFR_HROMC_RM_Pos)                  /* (SFR_HROMC) Read Margin Mask */
#define SFR_HROMC_RM(value)                   (SFR_HROMC_RM_Msk & (_UINT32_(value) << SFR_HROMC_RM_Pos)) /* Assigment of value for RM in the SFR_HROMC register */
#define SFR_HROMC_RME_Pos                     _UINT32_(4)                                          /* (SFR_HROMC) Read Margin Enable Position */
#define SFR_HROMC_RME_Msk                     (_UINT32_(0x1) << SFR_HROMC_RME_Pos)                 /* (SFR_HROMC) Read Margin Enable Mask */
#define SFR_HROMC_RME(value)                  (SFR_HROMC_RME_Msk & (_UINT32_(value) << SFR_HROMC_RME_Pos)) /* Assigment of value for RME in the SFR_HROMC register */
#define SFR_HROMC_LS_Pos                      _UINT32_(8)                                          /* (SFR_HROMC) HROMC Light Sleep Mode Position */
#define SFR_HROMC_LS_Msk                      (_UINT32_(0x1) << SFR_HROMC_LS_Pos)                  /* (SFR_HROMC) HROMC Light Sleep Mode Mask */
#define SFR_HROMC_LS(value)                   (SFR_HROMC_LS_Msk & (_UINT32_(value) << SFR_HROMC_LS_Pos)) /* Assigment of value for LS in the SFR_HROMC register */
#define SFR_HROMC_SD_Pos                      _UINT32_(9)                                          /* (SFR_HROMC) Shutdown Mode Position */
#define SFR_HROMC_SD_Msk                      (_UINT32_(0x1) << SFR_HROMC_SD_Pos)                  /* (SFR_HROMC) Shutdown Mode Mask */
#define SFR_HROMC_SD(value)                   (SFR_HROMC_SD_Msk & (_UINT32_(value) << SFR_HROMC_SD_Pos)) /* Assigment of value for SD in the SFR_HROMC register */
#define SFR_HROMC_Msk                         _UINT32_(0x0000031F)                                 /* (SFR_HROMC) Register Mask  */


/* -------- SFR_HCACHEI_VALID : (SFR Offset: 0x50) (R/W 32) HCACHEI Valid Memory Configuration Register -------- */
#define SFR_HCACHEI_VALID_RM_Pos              _UINT32_(0)                                          /* (SFR_HCACHEI_VALID) Read Margin Position */
#define SFR_HCACHEI_VALID_RM_Msk              (_UINT32_(0xF) << SFR_HCACHEI_VALID_RM_Pos)          /* (SFR_HCACHEI_VALID) Read Margin Mask */
#define SFR_HCACHEI_VALID_RM(value)           (SFR_HCACHEI_VALID_RM_Msk & (_UINT32_(value) << SFR_HCACHEI_VALID_RM_Pos)) /* Assigment of value for RM in the SFR_HCACHEI_VALID register */
#define SFR_HCACHEI_VALID_RME_Pos             _UINT32_(4)                                          /* (SFR_HCACHEI_VALID) Read Margin Enable Position */
#define SFR_HCACHEI_VALID_RME_Msk             (_UINT32_(0x1) << SFR_HCACHEI_VALID_RME_Pos)         /* (SFR_HCACHEI_VALID) Read Margin Enable Mask */
#define SFR_HCACHEI_VALID_RME(value)          (SFR_HCACHEI_VALID_RME_Msk & (_UINT32_(value) << SFR_HCACHEI_VALID_RME_Pos)) /* Assigment of value for RME in the SFR_HCACHEI_VALID register */
#define SFR_HCACHEI_VALID_LS_Pos              _UINT32_(8)                                          /* (SFR_HCACHEI_VALID) Light Sleep Mode Position */
#define SFR_HCACHEI_VALID_LS_Msk              (_UINT32_(0x1) << SFR_HCACHEI_VALID_LS_Pos)          /* (SFR_HCACHEI_VALID) Light Sleep Mode Mask */
#define SFR_HCACHEI_VALID_LS(value)           (SFR_HCACHEI_VALID_LS_Msk & (_UINT32_(value) << SFR_HCACHEI_VALID_LS_Pos)) /* Assigment of value for LS in the SFR_HCACHEI_VALID register */
#define SFR_HCACHEI_VALID_DS_Pos              _UINT32_(9)                                          /* (SFR_HCACHEI_VALID) Deep Sleep Mode Position */
#define SFR_HCACHEI_VALID_DS_Msk              (_UINT32_(0x1) << SFR_HCACHEI_VALID_DS_Pos)          /* (SFR_HCACHEI_VALID) Deep Sleep Mode Mask */
#define SFR_HCACHEI_VALID_DS(value)           (SFR_HCACHEI_VALID_DS_Msk & (_UINT32_(value) << SFR_HCACHEI_VALID_DS_Pos)) /* Assigment of value for DS in the SFR_HCACHEI_VALID register */
#define SFR_HCACHEI_VALID_SD_Pos              _UINT32_(10)                                         /* (SFR_HCACHEI_VALID) Shutdown Mode Position */
#define SFR_HCACHEI_VALID_SD_Msk              (_UINT32_(0x1) << SFR_HCACHEI_VALID_SD_Pos)          /* (SFR_HCACHEI_VALID) Shutdown Mode Mask */
#define SFR_HCACHEI_VALID_SD(value)           (SFR_HCACHEI_VALID_SD_Msk & (_UINT32_(value) << SFR_HCACHEI_VALID_SD_Pos)) /* Assigment of value for SD in the SFR_HCACHEI_VALID register */
#define SFR_HCACHEI_VALID_Msk                 _UINT32_(0x0000071F)                                 /* (SFR_HCACHEI_VALID) Register Mask  */


/* -------- SFR_HCACHEI_DATA : (SFR Offset: 0x54) (R/W 32) HCACHEI Data Memory Configuration Register -------- */
#define SFR_HCACHEI_DATA_RM_Pos               _UINT32_(0)                                          /* (SFR_HCACHEI_DATA) Read Margin Position */
#define SFR_HCACHEI_DATA_RM_Msk               (_UINT32_(0xFFFF) << SFR_HCACHEI_DATA_RM_Pos)        /* (SFR_HCACHEI_DATA) Read Margin Mask */
#define SFR_HCACHEI_DATA_RM(value)            (SFR_HCACHEI_DATA_RM_Msk & (_UINT32_(value) << SFR_HCACHEI_DATA_RM_Pos)) /* Assigment of value for RM in the SFR_HCACHEI_DATA register */
#define SFR_HCACHEI_DATA_RME_Pos              _UINT32_(16)                                         /* (SFR_HCACHEI_DATA) Read Margin Enable Position */
#define SFR_HCACHEI_DATA_RME_Msk              (_UINT32_(0xF) << SFR_HCACHEI_DATA_RME_Pos)          /* (SFR_HCACHEI_DATA) Read Margin Enable Mask */
#define SFR_HCACHEI_DATA_RME(value)           (SFR_HCACHEI_DATA_RME_Msk & (_UINT32_(value) << SFR_HCACHEI_DATA_RME_Pos)) /* Assigment of value for RME in the SFR_HCACHEI_DATA register */
#define SFR_HCACHEI_DATA_LS_Pos               _UINT32_(20)                                         /* (SFR_HCACHEI_DATA) Light Sleep Mode Position */
#define SFR_HCACHEI_DATA_LS_Msk               (_UINT32_(0xF) << SFR_HCACHEI_DATA_LS_Pos)           /* (SFR_HCACHEI_DATA) Light Sleep Mode Mask */
#define SFR_HCACHEI_DATA_LS(value)            (SFR_HCACHEI_DATA_LS_Msk & (_UINT32_(value) << SFR_HCACHEI_DATA_LS_Pos)) /* Assigment of value for LS in the SFR_HCACHEI_DATA register */
#define SFR_HCACHEI_DATA_DS_Pos               _UINT32_(24)                                         /* (SFR_HCACHEI_DATA) Deep Sleep Mode Position */
#define SFR_HCACHEI_DATA_DS_Msk               (_UINT32_(0xF) << SFR_HCACHEI_DATA_DS_Pos)           /* (SFR_HCACHEI_DATA) Deep Sleep Mode Mask */
#define SFR_HCACHEI_DATA_DS(value)            (SFR_HCACHEI_DATA_DS_Msk & (_UINT32_(value) << SFR_HCACHEI_DATA_DS_Pos)) /* Assigment of value for DS in the SFR_HCACHEI_DATA register */
#define SFR_HCACHEI_DATA_SD_Pos               _UINT32_(28)                                         /* (SFR_HCACHEI_DATA) Shutdown Mode Position */
#define SFR_HCACHEI_DATA_SD_Msk               (_UINT32_(0xF) << SFR_HCACHEI_DATA_SD_Pos)           /* (SFR_HCACHEI_DATA) Shutdown Mode Mask */
#define SFR_HCACHEI_DATA_SD(value)            (SFR_HCACHEI_DATA_SD_Msk & (_UINT32_(value) << SFR_HCACHEI_DATA_SD_Pos)) /* Assigment of value for SD in the SFR_HCACHEI_DATA register */
#define SFR_HCACHEI_DATA_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (SFR_HCACHEI_DATA) Register Mask  */


/* -------- SFR_HCACHEI_TAG : (SFR Offset: 0x58) (R/W 32) HCACHEI Tag Memory Configuration Register -------- */
#define SFR_HCACHEI_TAG_RM_Pos                _UINT32_(0)                                          /* (SFR_HCACHEI_TAG) Read Margin Position */
#define SFR_HCACHEI_TAG_RM_Msk                (_UINT32_(0xFFFF) << SFR_HCACHEI_TAG_RM_Pos)         /* (SFR_HCACHEI_TAG) Read Margin Mask */
#define SFR_HCACHEI_TAG_RM(value)             (SFR_HCACHEI_TAG_RM_Msk & (_UINT32_(value) << SFR_HCACHEI_TAG_RM_Pos)) /* Assigment of value for RM in the SFR_HCACHEI_TAG register */
#define SFR_HCACHEI_TAG_RME_Pos               _UINT32_(16)                                         /* (SFR_HCACHEI_TAG) Read Margin Enable Position */
#define SFR_HCACHEI_TAG_RME_Msk               (_UINT32_(0xF) << SFR_HCACHEI_TAG_RME_Pos)           /* (SFR_HCACHEI_TAG) Read Margin Enable Mask */
#define SFR_HCACHEI_TAG_RME(value)            (SFR_HCACHEI_TAG_RME_Msk & (_UINT32_(value) << SFR_HCACHEI_TAG_RME_Pos)) /* Assigment of value for RME in the SFR_HCACHEI_TAG register */
#define SFR_HCACHEI_TAG_LS_Pos                _UINT32_(20)                                         /* (SFR_HCACHEI_TAG) Light Sleep Mode Position */
#define SFR_HCACHEI_TAG_LS_Msk                (_UINT32_(0xF) << SFR_HCACHEI_TAG_LS_Pos)            /* (SFR_HCACHEI_TAG) Light Sleep Mode Mask */
#define SFR_HCACHEI_TAG_LS(value)             (SFR_HCACHEI_TAG_LS_Msk & (_UINT32_(value) << SFR_HCACHEI_TAG_LS_Pos)) /* Assigment of value for LS in the SFR_HCACHEI_TAG register */
#define SFR_HCACHEI_TAG_DS_Pos                _UINT32_(24)                                         /* (SFR_HCACHEI_TAG) Deep Sleep Mode Position */
#define SFR_HCACHEI_TAG_DS_Msk                (_UINT32_(0xF) << SFR_HCACHEI_TAG_DS_Pos)            /* (SFR_HCACHEI_TAG) Deep Sleep Mode Mask */
#define SFR_HCACHEI_TAG_DS(value)             (SFR_HCACHEI_TAG_DS_Msk & (_UINT32_(value) << SFR_HCACHEI_TAG_DS_Pos)) /* Assigment of value for DS in the SFR_HCACHEI_TAG register */
#define SFR_HCACHEI_TAG_SD_Pos                _UINT32_(28)                                         /* (SFR_HCACHEI_TAG) Shutdown Mode Position */
#define SFR_HCACHEI_TAG_SD_Msk                (_UINT32_(0xF) << SFR_HCACHEI_TAG_SD_Pos)            /* (SFR_HCACHEI_TAG) Shutdown Mode Mask */
#define SFR_HCACHEI_TAG_SD(value)             (SFR_HCACHEI_TAG_SD_Msk & (_UINT32_(value) << SFR_HCACHEI_TAG_SD_Pos)) /* Assigment of value for SD in the SFR_HCACHEI_TAG register */
#define SFR_HCACHEI_TAG_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (SFR_HCACHEI_TAG) Register Mask  */


/* -------- SFR_HCACHED_VALID : (SFR Offset: 0x60) (R/W 32) HCACHED Valid Memory Configuration Register -------- */
#define SFR_HCACHED_VALID_RM_Pos              _UINT32_(0)                                          /* (SFR_HCACHED_VALID) Read Margin Position */
#define SFR_HCACHED_VALID_RM_Msk              (_UINT32_(0xF) << SFR_HCACHED_VALID_RM_Pos)          /* (SFR_HCACHED_VALID) Read Margin Mask */
#define SFR_HCACHED_VALID_RM(value)           (SFR_HCACHED_VALID_RM_Msk & (_UINT32_(value) << SFR_HCACHED_VALID_RM_Pos)) /* Assigment of value for RM in the SFR_HCACHED_VALID register */
#define SFR_HCACHED_VALID_RME_Pos             _UINT32_(4)                                          /* (SFR_HCACHED_VALID) Read Margin Enable Position */
#define SFR_HCACHED_VALID_RME_Msk             (_UINT32_(0x1) << SFR_HCACHED_VALID_RME_Pos)         /* (SFR_HCACHED_VALID) Read Margin Enable Mask */
#define SFR_HCACHED_VALID_RME(value)          (SFR_HCACHED_VALID_RME_Msk & (_UINT32_(value) << SFR_HCACHED_VALID_RME_Pos)) /* Assigment of value for RME in the SFR_HCACHED_VALID register */
#define SFR_HCACHED_VALID_LS_Pos              _UINT32_(8)                                          /* (SFR_HCACHED_VALID) Light Sleep Mode Position */
#define SFR_HCACHED_VALID_LS_Msk              (_UINT32_(0x1) << SFR_HCACHED_VALID_LS_Pos)          /* (SFR_HCACHED_VALID) Light Sleep Mode Mask */
#define SFR_HCACHED_VALID_LS(value)           (SFR_HCACHED_VALID_LS_Msk & (_UINT32_(value) << SFR_HCACHED_VALID_LS_Pos)) /* Assigment of value for LS in the SFR_HCACHED_VALID register */
#define SFR_HCACHED_VALID_DS_Pos              _UINT32_(9)                                          /* (SFR_HCACHED_VALID) Deep Sleep Mode Position */
#define SFR_HCACHED_VALID_DS_Msk              (_UINT32_(0x1) << SFR_HCACHED_VALID_DS_Pos)          /* (SFR_HCACHED_VALID) Deep Sleep Mode Mask */
#define SFR_HCACHED_VALID_DS(value)           (SFR_HCACHED_VALID_DS_Msk & (_UINT32_(value) << SFR_HCACHED_VALID_DS_Pos)) /* Assigment of value for DS in the SFR_HCACHED_VALID register */
#define SFR_HCACHED_VALID_SD_Pos              _UINT32_(10)                                         /* (SFR_HCACHED_VALID) Shutdown Mode Position */
#define SFR_HCACHED_VALID_SD_Msk              (_UINT32_(0x1) << SFR_HCACHED_VALID_SD_Pos)          /* (SFR_HCACHED_VALID) Shutdown Mode Mask */
#define SFR_HCACHED_VALID_SD(value)           (SFR_HCACHED_VALID_SD_Msk & (_UINT32_(value) << SFR_HCACHED_VALID_SD_Pos)) /* Assigment of value for SD in the SFR_HCACHED_VALID register */
#define SFR_HCACHED_VALID_Msk                 _UINT32_(0x0000071F)                                 /* (SFR_HCACHED_VALID) Register Mask  */


