Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sfr.h
/* -------- SFR_HCACHED_DATA : (SFR Offset: 0x64) (R/W 32) HCACHED Data Memory Configuration Register -------- */
#define SFR_HCACHED_DATA_RM_Pos               _UINT32_(0)                                          /* (SFR_HCACHED_DATA) Read Margin Position */
#define SFR_HCACHED_DATA_RM_Msk               (_UINT32_(0xFFFF) << SFR_HCACHED_DATA_RM_Pos)        /* (SFR_HCACHED_DATA) Read Margin Mask */
#define SFR_HCACHED_DATA_RM(value)            (SFR_HCACHED_DATA_RM_Msk & (_UINT32_(value) << SFR_HCACHED_DATA_RM_Pos)) /* Assigment of value for RM in the SFR_HCACHED_DATA register */
#define SFR_HCACHED_DATA_RME_Pos              _UINT32_(16)                                         /* (SFR_HCACHED_DATA) Read Margin Enable Position */
#define SFR_HCACHED_DATA_RME_Msk              (_UINT32_(0xF) << SFR_HCACHED_DATA_RME_Pos)          /* (SFR_HCACHED_DATA) Read Margin Enable Mask */
#define SFR_HCACHED_DATA_RME(value)           (SFR_HCACHED_DATA_RME_Msk & (_UINT32_(value) << SFR_HCACHED_DATA_RME_Pos)) /* Assigment of value for RME in the SFR_HCACHED_DATA register */
#define SFR_HCACHED_DATA_LS_Pos               _UINT32_(20)                                         /* (SFR_HCACHED_DATA) Light Sleep Mode Position */
#define SFR_HCACHED_DATA_LS_Msk               (_UINT32_(0xF) << SFR_HCACHED_DATA_LS_Pos)           /* (SFR_HCACHED_DATA) Light Sleep Mode Mask */
#define SFR_HCACHED_DATA_LS(value)            (SFR_HCACHED_DATA_LS_Msk & (_UINT32_(value) << SFR_HCACHED_DATA_LS_Pos)) /* Assigment of value for LS in the SFR_HCACHED_DATA register */
#define SFR_HCACHED_DATA_DS_Pos               _UINT32_(24)                                         /* (SFR_HCACHED_DATA) Deep Sleep Mode Position */
#define SFR_HCACHED_DATA_DS_Msk               (_UINT32_(0xF) << SFR_HCACHED_DATA_DS_Pos)           /* (SFR_HCACHED_DATA) Deep Sleep Mode Mask */
#define SFR_HCACHED_DATA_DS(value)            (SFR_HCACHED_DATA_DS_Msk & (_UINT32_(value) << SFR_HCACHED_DATA_DS_Pos)) /* Assigment of value for DS in the SFR_HCACHED_DATA register */
#define SFR_HCACHED_DATA_SD_Pos               _UINT32_(28)                                         /* (SFR_HCACHED_DATA) Shutdown Mode Position */
#define SFR_HCACHED_DATA_SD_Msk               (_UINT32_(0xF) << SFR_HCACHED_DATA_SD_Pos)           /* (SFR_HCACHED_DATA) Shutdown Mode Mask */
#define SFR_HCACHED_DATA_SD(value)            (SFR_HCACHED_DATA_SD_Msk & (_UINT32_(value) << SFR_HCACHED_DATA_SD_Pos)) /* Assigment of value for SD in the SFR_HCACHED_DATA register */
#define SFR_HCACHED_DATA_Msk                  _UINT32_(0xFFFFFFFF)                                 /* (SFR_HCACHED_DATA) Register Mask  */


/* -------- SFR_HCACHED_TAG : (SFR Offset: 0x68) (R/W 32) HCACHEDTag Memory Configuration Register -------- */
#define SFR_HCACHED_TAG_RM_Pos                _UINT32_(0)                                          /* (SFR_HCACHED_TAG) Read Margin Position */
#define SFR_HCACHED_TAG_RM_Msk                (_UINT32_(0xFFFF) << SFR_HCACHED_TAG_RM_Pos)         /* (SFR_HCACHED_TAG) Read Margin Mask */
#define SFR_HCACHED_TAG_RM(value)             (SFR_HCACHED_TAG_RM_Msk & (_UINT32_(value) << SFR_HCACHED_TAG_RM_Pos)) /* Assigment of value for RM in the SFR_HCACHED_TAG register */
#define SFR_HCACHED_TAG_RME_Pos               _UINT32_(16)                                         /* (SFR_HCACHED_TAG) Read Margin Enable Position */
#define SFR_HCACHED_TAG_RME_Msk               (_UINT32_(0xF) << SFR_HCACHED_TAG_RME_Pos)           /* (SFR_HCACHED_TAG) Read Margin Enable Mask */
#define SFR_HCACHED_TAG_RME(value)            (SFR_HCACHED_TAG_RME_Msk & (_UINT32_(value) << SFR_HCACHED_TAG_RME_Pos)) /* Assigment of value for RME in the SFR_HCACHED_TAG register */
#define SFR_HCACHED_TAG_LS_Pos                _UINT32_(20)                                         /* (SFR_HCACHED_TAG) Light Sleep Mode Position */
#define SFR_HCACHED_TAG_LS_Msk                (_UINT32_(0xF) << SFR_HCACHED_TAG_LS_Pos)            /* (SFR_HCACHED_TAG) Light Sleep Mode Mask */
#define SFR_HCACHED_TAG_LS(value)             (SFR_HCACHED_TAG_LS_Msk & (_UINT32_(value) << SFR_HCACHED_TAG_LS_Pos)) /* Assigment of value for LS in the SFR_HCACHED_TAG register */
#define SFR_HCACHED_TAG_DS_Pos                _UINT32_(24)                                         /* (SFR_HCACHED_TAG) Deep Sleep Mode Position */
#define SFR_HCACHED_TAG_DS_Msk                (_UINT32_(0xF) << SFR_HCACHED_TAG_DS_Pos)            /* (SFR_HCACHED_TAG) Deep Sleep Mode Mask */
#define SFR_HCACHED_TAG_DS(value)             (SFR_HCACHED_TAG_DS_Msk & (_UINT32_(value) << SFR_HCACHED_TAG_DS_Pos)) /* Assigment of value for DS in the SFR_HCACHED_TAG register */
#define SFR_HCACHED_TAG_SD_Pos                _UINT32_(28)                                         /* (SFR_HCACHED_TAG) Shutdown Mode Position */
#define SFR_HCACHED_TAG_SD_Msk                (_UINT32_(0xF) << SFR_HCACHED_TAG_SD_Pos)            /* (SFR_HCACHED_TAG) Shutdown Mode Mask */
#define SFR_HCACHED_TAG_SD(value)             (SFR_HCACHED_TAG_SD_Msk & (_UINT32_(value) << SFR_HCACHED_TAG_SD_Pos)) /* Assigment of value for SD in the SFR_HCACHED_TAG register */
#define SFR_HCACHED_TAG_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (SFR_HCACHED_TAG) Register Mask  */


/* -------- SFR_FLASH : (SFR Offset: 0x70) (R/W 32) Flash Memory Configuration Register -------- */
#define SFR_FLASH_PATCH_BYPASS_Pos            _UINT32_(0)                                          /* (SFR_FLASH)  Position */
#define SFR_FLASH_PATCH_BYPASS_Msk            (_UINT32_(0x1) << SFR_FLASH_PATCH_BYPASS_Pos)        /* (SFR_FLASH)  Mask */
#define SFR_FLASH_PATCH_BYPASS(value)         (SFR_FLASH_PATCH_BYPASS_Msk & (_UINT32_(value) << SFR_FLASH_PATCH_BYPASS_Pos)) /* Assigment of value for PATCH_BYPASS in the SFR_FLASH register */
#define SFR_FLASH_Msk                         _UINT32_(0x00000001)                                 /* (SFR_FLASH) Register Mask  */


/* -------- SFR_OPT_LINK : (SFR Offset: 0x80) (R/W 32) Optical Link Register -------- */
#define SFR_OPT_LINK_CLK_SELECT_Pos           _UINT32_(0)                                          /* (SFR_OPT_LINK) Clock Selection Position */
#define SFR_OPT_LINK_CLK_SELECT_Msk           (_UINT32_(0x1) << SFR_OPT_LINK_CLK_SELECT_Pos)       /* (SFR_OPT_LINK) Clock Selection Mask */
#define SFR_OPT_LINK_CLK_SELECT(value)        (SFR_OPT_LINK_CLK_SELECT_Msk & (_UINT32_(value) << SFR_OPT_LINK_CLK_SELECT_Pos)) /* Assigment of value for CLK_SELECT in the SFR_OPT_LINK register */
#define SFR_OPT_LINK_Msk                      _UINT32_(0x00000001)                                 /* (SFR_OPT_LINK) Register Mask  */


/* -------- SFR_JTAG : (SFR Offset: 0x90) (R/W 32) JTAG Register -------- */
#define SFR_JTAG_JTAG_LOCK_Pos                _UINT32_(0)                                          /* (SFR_JTAG) JTAG Lock Position */
#define SFR_JTAG_JTAG_LOCK_Msk                (_UINT32_(0x1) << SFR_JTAG_JTAG_LOCK_Pos)            /* (SFR_JTAG) JTAG Lock Mask */
#define SFR_JTAG_JTAG_LOCK(value)             (SFR_JTAG_JTAG_LOCK_Msk & (_UINT32_(value) << SFR_JTAG_JTAG_LOCK_Pos)) /* Assigment of value for JTAG_LOCK in the SFR_JTAG register */
#define SFR_JTAG_Msk                          _UINT32_(0x00000001)                                 /* (SFR_JTAG) Register Mask  */


