Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sfr.h
/* -------- SFR_FFPI : (SFR Offset: 0xB8) ( R/ 32) FFPI Register -------- */
#define SFR_FFPI_MODE_Pos                     _UINT32_(0)                                          /* (SFR_FFPI) FFPI Status Position */
#define SFR_FFPI_MODE_Msk                     (_UINT32_(0x1) << SFR_FFPI_MODE_Pos)                 /* (SFR_FFPI) FFPI Status Mask */
#define SFR_FFPI_MODE(value)                  (SFR_FFPI_MODE_Msk & (_UINT32_(value) << SFR_FFPI_MODE_Pos)) /* Assigment of value for MODE in the SFR_FFPI register */
#define SFR_FFPI_Msk                          _UINT32_(0x00000001)                                 /* (SFR_FFPI) Register Mask  */


/* -------- SFR_WAIT_MODE : (SFR Offset: 0xBC) (R/W 32) Improved Wait Mode Register -------- */
#define SFR_WAIT_MODE_CONTROL_Pos             _UINT32_(0)                                          /* (SFR_WAIT_MODE) Improved Wait Mode Control Position */
#define SFR_WAIT_MODE_CONTROL_Msk             (_UINT32_(0x1) << SFR_WAIT_MODE_CONTROL_Pos)         /* (SFR_WAIT_MODE) Improved Wait Mode Control Mask */
#define SFR_WAIT_MODE_CONTROL(value)          (SFR_WAIT_MODE_CONTROL_Msk & (_UINT32_(value) << SFR_WAIT_MODE_CONTROL_Pos)) /* Assigment of value for CONTROL in the SFR_WAIT_MODE register */
#define SFR_WAIT_MODE_Msk                     _UINT32_(0x00000001)                                 /* (SFR_WAIT_MODE) Register Mask  */


/* -------- SFR_ROM_CODE : (SFR Offset: 0xC0) ( R/ 32) ROM Code Register -------- */
#define SFR_ROM_CODE_PLLA_STATUS_Pos          _UINT32_(0)                                          /* (SFR_ROM_CODE) PLLA Status Position */
#define SFR_ROM_CODE_PLLA_STATUS_Msk          (_UINT32_(0x3) << SFR_ROM_CODE_PLLA_STATUS_Pos)      /* (SFR_ROM_CODE) PLLA Status Mask */
#define SFR_ROM_CODE_PLLA_STATUS(value)       (SFR_ROM_CODE_PLLA_STATUS_Msk & (_UINT32_(value) << SFR_ROM_CODE_PLLA_STATUS_Pos)) /* Assigment of value for PLLA_STATUS in the SFR_ROM_CODE register */
#define SFR_ROM_CODE_FORCE_BYPASS_Pos         _UINT32_(2)                                          /* (SFR_ROM_CODE)  Position */
#define SFR_ROM_CODE_FORCE_BYPASS_Msk         (_UINT32_(0x1) << SFR_ROM_CODE_FORCE_BYPASS_Pos)     /* (SFR_ROM_CODE)  Mask */
#define SFR_ROM_CODE_FORCE_BYPASS(value)      (SFR_ROM_CODE_FORCE_BYPASS_Msk & (_UINT32_(value) << SFR_ROM_CODE_FORCE_BYPASS_Pos)) /* Assigment of value for FORCE_BYPASS in the SFR_ROM_CODE register */
#define SFR_ROM_CODE_FORCE_BYPASS_VALUE_Pos   _UINT32_(3)                                          /* (SFR_ROM_CODE)  Position */
#define SFR_ROM_CODE_FORCE_BYPASS_VALUE_Msk   (_UINT32_(0x1) << SFR_ROM_CODE_FORCE_BYPASS_VALUE_Pos) /* (SFR_ROM_CODE)  Mask */
#define SFR_ROM_CODE_FORCE_BYPASS_VALUE(value) (SFR_ROM_CODE_FORCE_BYPASS_VALUE_Msk & (_UINT32_(value) << SFR_ROM_CODE_FORCE_BYPASS_VALUE_Pos)) /* Assigment of value for FORCE_BYPASS_VALUE in the SFR_ROM_CODE register */
#define SFR_ROM_CODE_Msk                      _UINT32_(0x0000000F)                                 /* (SFR_ROM_CODE) Register Mask  */


/* -------- SFR_WPMR : (SFR Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define SFR_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (SFR_WPMR) Write Protection Enable Position */
#define SFR_WPMR_WPEN_Msk                     (_UINT32_(0x1) << SFR_WPMR_WPEN_Pos)                 /* (SFR_WPMR) Write Protection Enable Mask */
#define SFR_WPMR_WPEN(value)                  (SFR_WPMR_WPEN_Msk & (_UINT32_(value) << SFR_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the SFR_WPMR register */
#define SFR_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (SFR_WPMR) Write Protection Key Position */
#define SFR_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << SFR_WPMR_WPKEY_Pos)           /* (SFR_WPMR) Write Protection Key Mask */
#define SFR_WPMR_WPKEY(value)                 (SFR_WPMR_WPKEY_Msk & (_UINT32_(value) << SFR_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the SFR_WPMR register */
#define   SFR_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x534652)                                   /* (SFR_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define SFR_WPMR_WPKEY_PASSWD                 (SFR_WPMR_WPKEY_PASSWD_Val << SFR_WPMR_WPKEY_Pos)    /* (SFR_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define SFR_WPMR_Msk                          _UINT32_(0xFFFFFF01)                                 /* (SFR_WPMR) Register Mask  */


/* -------- SFR_WPSR : (SFR Offset: 0xE8) (R/W 32) Write Protection Status Register -------- */
#define SFR_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (SFR_WPSR) Write Protection Violation Status Position */
#define SFR_WPSR_WPVS_Msk                     (_UINT32_(0x1) << SFR_WPSR_WPVS_Pos)                 /* (SFR_WPSR) Write Protection Violation Status Mask */
#define SFR_WPSR_WPVS(value)                  (SFR_WPSR_WPVS_Msk & (_UINT32_(value) << SFR_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the SFR_WPSR register */
#define SFR_WPSR_WPSRC_Pos                    _UINT32_(8)                                          /* (SFR_WPSR) Write Protection Source Position */
#define SFR_WPSR_WPSRC_Msk                    (_UINT32_(0xFFFF) << SFR_WPSR_WPSRC_Pos)             /* (SFR_WPSR) Write Protection Source Mask */
#define SFR_WPSR_WPSRC(value)                 (SFR_WPSR_WPSRC_Msk & (_UINT32_(value) << SFR_WPSR_WPSRC_Pos)) /* Assigment of value for WPSRC in the SFR_WPSR register */
#define SFR_WPSR_Msk                          _UINT32_(0x00FFFF01)                                 /* (SFR_WPSR) Register Mask  */


/* -------- SFR_SPARE : (SFR Offset: 0xF0) (R/W 32) Spare Register -------- */
#define SFR_SPARE_VALUE_Pos                   _UINT32_(0)                                          /* (SFR_SPARE) Spare Position */
#define SFR_SPARE_VALUE_Msk                   (_UINT32_(0xFFFFFFFF) << SFR_SPARE_VALUE_Pos)        /* (SFR_SPARE) Spare Mask */
#define SFR_SPARE_VALUE(value)                (SFR_SPARE_VALUE_Msk & (_UINT32_(value) << SFR_SPARE_VALUE_Pos)) /* Assigment of value for VALUE in the SFR_SPARE register */
#define SFR_SPARE_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (SFR_SPARE) Register Mask  */


/* -------- SFR_VERSION : (SFR Offset: 0xFC) ( R/ 32) Version Register -------- */
#define SFR_VERSION_VERSION_Pos               _UINT32_(0)                                          /* (SFR_VERSION) Version of the Hardware Module Position */
#define SFR_VERSION_VERSION_Msk               (_UINT32_(0xFFF) << SFR_VERSION_VERSION_Pos)         /* (SFR_VERSION) Version of the Hardware Module Mask */
#define SFR_VERSION_VERSION(value)            (SFR_VERSION_VERSION_Msk & (_UINT32_(value) << SFR_VERSION_VERSION_Pos)) /* Assigment of value for VERSION in the SFR_VERSION register */
#define SFR_VERSION_MFN_Pos                   _UINT32_(16)                                         /* (SFR_VERSION) Metal Fix Number Position */
#define SFR_VERSION_MFN_Msk                   (_UINT32_(0x7) << SFR_VERSION_MFN_Pos)               /* (SFR_VERSION) Metal Fix Number Mask */
#define SFR_VERSION_MFN(value)                (SFR_VERSION_MFN_Msk & (_UINT32_(value) << SFR_VERSION_MFN_Pos)) /* Assigment of value for MFN in the SFR_VERSION register */
#define SFR_VERSION_Msk                       _UINT32_(0x00070FFF)                                 /* (SFR_VERSION) Register Mask  */


/** \brief SFR register offsets definitions */
#define SFR_SRAM0_SW_CFG_REG_OFST      _UINT32_(0x10)      /* (SFR_SRAM0_SW_CFG) SRAM0 Software Config Register Offset */
#define SFR_SRAM0_HW_CFG_REG_OFST      _UINT32_(0x14)      /* (SFR_SRAM0_HW_CFG) SRAM0 Hardware Status Register Offset */
#define SFR_SRAM0_CH_REG_OFST          _UINT32_(0x18)      /* (SFR_SRAM0_CH) SRAM0 Read Margin Register Channel Offset */
#define SFR_SRAM0_CH0_REG_OFST         _UINT32_(0x18)      /* (SFR_SRAM0_CH0) SRAM0 Read Margin Register Channel Offset */
#define SFR_SRAM0_CH1_REG_OFST         _UINT32_(0x1C)      /* (SFR_SRAM0_CH1) SRAM0 Read Margin Register Channel Offset */
#define SFR_SRAM0_CH2_REG_OFST         _UINT32_(0x20)      /* (SFR_SRAM0_CH2) SRAM0 Read Margin Register Channel Offset */
#define SFR_SRAM0_CH3_REG_OFST         _UINT32_(0x24)      /* (SFR_SRAM0_CH3) SRAM0 Read Margin Register Channel Offset */
#define SFR_SRAM_REG_OFST              _UINT32_(0x28)      /* (SFR_SRAM) SRAM Configuration Register Offset */
#define SFR_SRAM0_REG_OFST             _UINT32_(0x28)      /* (SFR_SRAM0) SRAM Configuration Register Offset */
#define SFR_SRAM1_REG_OFST             _UINT32_(0x2C)      /* (SFR_SRAM1) SRAM Configuration Register Offset */
#define SFR_CPKCC_REG_OFST             _UINT32_(0x30)      /* (SFR_CPKCC) CPKCC Memory Configuration Register Offset */
#define SFR_HROMC_REG_OFST             _UINT32_(0x40)      /* (SFR_HROMC) HROMC Memory Configuration Register Offset */
#define SFR_HCACHEI_VALID_REG_OFST     _UINT32_(0x50)      /* (SFR_HCACHEI_VALID) HCACHEI Valid Memory Configuration Register Offset */
#define SFR_HCACHEI_DATA_REG_OFST      _UINT32_(0x54)      /* (SFR_HCACHEI_DATA) HCACHEI Data Memory Configuration Register Offset */
#define SFR_HCACHEI_TAG_REG_OFST       _UINT32_(0x58)      /* (SFR_HCACHEI_TAG) HCACHEI Tag Memory Configuration Register Offset */
#define SFR_HCACHED_VALID_REG_OFST     _UINT32_(0x60)      /* (SFR_HCACHED_VALID) HCACHED Valid Memory Configuration Register Offset */
#define SFR_HCACHED_DATA_REG_OFST      _UINT32_(0x64)      /* (SFR_HCACHED_DATA) HCACHED Data Memory Configuration Register Offset */
#define SFR_HCACHED_TAG_REG_OFST       _UINT32_(0x68)      /* (SFR_HCACHED_TAG) HCACHEDTag Memory Configuration Register Offset */
#define SFR_FLASH_REG_OFST             _UINT32_(0x70)      /* (SFR_FLASH) Flash Memory Configuration Register Offset */
#define SFR_OPT_LINK_REG_OFST          _UINT32_(0x80)      /* (SFR_OPT_LINK) Optical Link Register Offset */
#define SFR_JTAG_REG_OFST              _UINT32_(0x90)      /* (SFR_JTAG) JTAG Register Offset */
#define SFR_CORE_DEBUG_CFG_REG_OFST    _UINT32_(0xA0)      /* (SFR_CORE_DEBUG_CFG) Core Debug Configuration Register Offset */
#define SFR_EMAHB2AHB_REG_OFST         _UINT32_(0xA4)      /* (SFR_EMAHB2AHB) AHB2AHB Configuration Register Offset */
#define SFR_SECURE_REG_OFST            _UINT32_(0xA8)      /* (SFR_SECURE) Secure Register Offset */
#define SFR_SECURE_BIT_REG_OFST        _UINT32_(0xAC)      /* (SFR_SECURE_BIT) Secure Bit Register Offset */
#define SFR_ERASE_FLASH_SRAM_REG_OFST  _UINT32_(0xB0)      /* (SFR_ERASE_FLASH_SRAM) Erase Flash/SRAM Register Offset */
#define SFR_PWM_DEBUG_REG_OFST         _UINT32_(0xB4)      /* (SFR_PWM_DEBUG) PWM Debug Register Offset */
#define SFR_FFPI_REG_OFST              _UINT32_(0xB8)      /* (SFR_FFPI) FFPI Register Offset */
#define SFR_WAIT_MODE_REG_OFST         _UINT32_(0xBC)      /* (SFR_WAIT_MODE) Improved Wait Mode Register Offset */
#define SFR_ROM_CODE_REG_OFST          _UINT32_(0xC0)      /* (SFR_ROM_CODE) ROM Code Register Offset */
#define SFR_WPMR_REG_OFST              _UINT32_(0xE4)      /* (SFR_WPMR) Write Protection Mode Register Offset */
#define SFR_WPSR_REG_OFST              _UINT32_(0xE8)      /* (SFR_WPSR) Write Protection Status Register Offset */
#define SFR_SPARE_REG_OFST             _UINT32_(0xF0)      /* (SFR_SPARE) Spare Register Offset */
#define SFR_VERSION_REG_OFST           _UINT32_(0xFC)      /* (SFR_VERSION) Version Register Offset */

