Microchip-MPLAB-Harmony/smartenergy/apps/metering_demo/firmware/src/packs/PIC32CX2051MTC128_DFP/component/sfr.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SFR register API structure */
typedef struct
{
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       SFR_SRAM0_SW_CFG;   /**< Offset: 0x10 (R/W  32) SRAM0 Software Config Register */
  __I   uint32_t                       SFR_SRAM0_HW_CFG;   /**< Offset: 0x14 (R/   32) SRAM0 Hardware Status Register */
  __IO  uint32_t                       SFR_SRAM0_CH[4];    /**< Offset: 0x18 (R/W  32) SRAM0 Read Margin Register Channel */
  __IO  uint32_t                       SFR_SRAM[2];        /**< Offset: 0x28 (R/W  32) SRAM Configuration Register */
  __IO  uint32_t                       SFR_CPKCC;          /**< Offset: 0x30 (R/W  32) CPKCC Memory Configuration Register */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       SFR_HROMC;          /**< Offset: 0x40 (R/W  32) HROMC Memory Configuration Register */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       SFR_HCACHEI_VALID;  /**< Offset: 0x50 (R/W  32) HCACHEI Valid Memory Configuration Register */
  __IO  uint32_t                       SFR_HCACHEI_DATA;   /**< Offset: 0x54 (R/W  32) HCACHEI Data Memory Configuration Register */
  __IO  uint32_t                       SFR_HCACHEI_TAG;    /**< Offset: 0x58 (R/W  32) HCACHEI Tag Memory Configuration Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  uint32_t                       SFR_HCACHED_VALID;  /**< Offset: 0x60 (R/W  32) HCACHED Valid Memory Configuration Register */
  __IO  uint32_t                       SFR_HCACHED_DATA;   /**< Offset: 0x64 (R/W  32) HCACHED Data Memory Configuration Register */
  __IO  uint32_t                       SFR_HCACHED_TAG;    /**< Offset: 0x68 (R/W  32) HCACHEDTag Memory Configuration Register */
  __I   uint8_t                        Reserved5[0x04];
  __IO  uint32_t                       SFR_FLASH;          /**< Offset: 0x70 (R/W  32) Flash Memory Configuration Register */
  __I   uint8_t                        Reserved6[0x0C];
  __IO  uint32_t                       SFR_OPT_LINK;       /**< Offset: 0x80 (R/W  32) Optical Link Register */
  __I   uint8_t                        Reserved7[0x0C];
  __IO  uint32_t                       SFR_JTAG;           /**< Offset: 0x90 (R/W  32) JTAG Register */
  __I   uint8_t                        Reserved8[0x0C];
  __IO  uint32_t                       SFR_CORE_DEBUG_CFG; /**< Offset: 0xA0 (R/W  32) Core Debug Configuration Register */
  __IO  uint32_t                       SFR_EMAHB2AHB;      /**< Offset: 0xA4 (R/W  32) AHB2AHB Configuration Register */
  __IO  uint32_t                       SFR_SECURE;         /**< Offset: 0xA8 (R/W  32) Secure Register */
  __I   uint32_t                       SFR_SECURE_BIT;     /**< Offset: 0xAC (R/   32) Secure Bit Register */
  __IO  uint32_t                       SFR_ERASE_FLASH_SRAM; /**< Offset: 0xB0 (R/W  32) Erase Flash/SRAM Register */
  __IO  uint32_t                       SFR_PWM_DEBUG;      /**< Offset: 0xB4 (R/W  32) PWM Debug Register */
  __I   uint32_t                       SFR_FFPI;           /**< Offset: 0xB8 (R/   32) FFPI Register */
  __IO  uint32_t                       SFR_WAIT_MODE;      /**< Offset: 0xBC (R/W  32) Improved Wait Mode Register */
  __I   uint32_t                       SFR_ROM_CODE;       /**< Offset: 0xC0 (R/   32) ROM Code Register */
  __I   uint8_t                        Reserved9[0x20];
  __IO  uint32_t                       SFR_WPMR;           /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __IO  uint32_t                       SFR_WPSR;           /**< Offset: 0xE8 (R/W  32) Write Protection Status Register */
  __I   uint8_t                        Reserved10[0x04];
  __IO  uint32_t                       SFR_SPARE;          /**< Offset: 0xF0 (R/W  32) Spare Register */
  __I   uint8_t                        Reserved11[0x08];
  __I   uint32_t                       SFR_VERSION;        /**< Offset: 0xFC (R/   32) Version Register */
} sfr_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTC_SFR_COMPONENT_H_ */
